first_routes/app/controllers/artworks_controller.rb

    def index
        user_id = params[:user][:id]
        @artworks = Artwork.left_outer_joins(:shares).where("(:user_id = artworks.artist_id) or (:user_id = artwork_shares.viewer_id)", user_id: user_id).distinct
---
SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" "shared_viewers_artworks" ON "shared_viewers_artworks"."id" = "artwork_shares"."viewer_id" WHERE (user_id = artist_id or user_id = viewer_id)

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "bone_updated.com"], ["updated_at", "2021-09-16 15:45:35.542230"], ["id", 1]]