first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "mom"], ["updated_at", "2021-09-15 21:19:33.538380"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        # debugger
        if @user.update(user_params)